backend/app/controllers/cards_controller.rb

  def create
    @card = Card.create(card_params)
    # render json: @card
    # binding.pry

    if @card.save
      @cards = Card.all
---
INSERT INTO "cards" ("title", "question", "answer", "created_at", "updated_at", "language_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test123123"], ["question", "test123123"], ["answer", "test123123"], ["created_at", "2020-04-28 21:48:57.199577"], ["updated_at", "2020-04-28 21:48:57.199577"], ["language_id", 1]]
SELECT "cards".* FROM "cards"

  def destroy
    @card.destroy
    @cards = Card.all
---
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 91]]
SELECT "cards".* FROM "cards"