backend/app/controllers/languages_controller.rb

  def index
    @languages = Language.all
---
SELECT "languages".* FROM "languages"

    def set_language
      @language = Language.find(params[:id])
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]